old_projects/cylinders/cylinder/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (1 0 0);

boundaryField
{
    inlet
 	{
 	   type fixedValue;
 	   value uniform (1 0 0);
 	}
 	outlet
 	{
 	   type zeroGradient;
 	}
 	bottom
 	{
 	   type slip;
 	}
 	top
 	{
 	   type slip;
 	}
 	cylinder
 	{
 	   type fixedValue;
 	   value uniform (0 0 0);
 	}
 	defaultFaces
 	{
 	    type empty;
 	}
}

// ************************************************************************* //
